#ifndef INCLUDED_DXTK_AUDIO
#define	INCLUDED_DXTK_AUDIO
//******************************************************************************
//
//
//		DirectXTKAudio
//
//
//******************************************************************************

//------< ƒCƒ“ƒNƒ‹[ƒh >----------------------------------------------------------
#include <algorithm>
#include "system.h"
#include "./DirectXTK-master/Inc/Audio.h"

namespace GameLib
{

    const int MUSIC_FILE_MAX    = 32;   // Å‘å‰¹Šy”
    const int XWB_FILE_MAX      = 16;   // Å‘åxwbƒtƒ@ƒCƒ‹”
    const int WAVE_FILE_MAX     = 128;  // 1‚Â‚Ìxwbƒtƒ@ƒCƒ‹‚ ‚½‚è‚Ìwaveƒtƒ@ƒCƒ‹”
    const int WAVE_SOUND_MAX    = 8;    // Å‘å8‰¹“¯Ä¶OK

    namespace audio
    {
        //======================================================================
        //
        //      DXTKAudioƒNƒ‰ƒX
        //
        //======================================================================
        class DXTKAudio
        {
        public:

            class Music {
            private:
                std::unique_ptr<DirectX::SoundEffect>           music       = nullptr;
                std::unique_ptr<DirectX::SoundEffectInstance>	musicInst   = nullptr;
                float                                           defVolume   = 0.5f;
                float											curVolume   = 0.0f;
                float                                           fadeVolume  = 0.0f;
                float                                           add         = 0.0f;
                float                                           pitch       = 0.0f;
                float                                           pan         = 0.0f;

            public:
                Music() {}

                //--------------------------------------------------------------
                //  XVˆ—
                //--------------------------------------------------------------
                void update()
                {
                    // ƒ|[ƒY’†‚â’â~’†‚ÍƒtƒF[ƒh‚ğs‚í‚È‚¢
                    if (isInUse() && getState() != DirectX::SoundState::PLAYING)
                        return;

                    // ƒtƒF[ƒhƒCƒ“
                    if (add > 0)
                    {
                        curVolume += add;
                        if (curVolume > fadeVolume)
                        {
                            curVolume = fadeVolume;
                            add = 0.0f;
                        }
                        setVolume(curVolume);
                    }

                    // ƒtƒF[ƒhƒAƒEƒg
                    if (add < 0)
                    {
                        curVolume += add;
                        if (curVolume < fadeVolume)
                        {
                            curVolume = fadeVolume;
                            add = 0.0f;
                        }
                        setVolume(curVolume);

                        // ƒ{ƒŠƒ…[ƒ€‚ª0ˆÈ‰º‚É‚È‚Á‚½‚ç’â~
                        if (curVolume <= 0.0f)
                        {
                            stop();
                        }
                    }
                }

                //--------------------------------------------------------------
                //  ‰¹Šy‚Ì“Ç‚İ‚İ
                //--------------------------------------------------------------
                void load(DirectX::AudioEngine* engine, const wchar_t* waveFileName, float volume)
                {
                    if (musicInst) musicInst.reset();
                    music.reset(new DirectX::SoundEffect(engine, waveFileName));
                    defVolume = volume;
                    curVolume = volume;
                }

                //--------------------------------------------------------------
                //  ”jŠü
                //--------------------------------------------------------------
                void unload()
                {
                    if (musicInst)  musicInst.reset();
                    if (music)      music.reset(nullptr);
                }

                //--------------------------------------------------------------
                //  Ä¶
                //--------------------------------------------------------------
                void play(bool isLoop)
                {
                    if (!music) return;
                    musicInst = music->CreateInstance();
                    musicInst->Play(isLoop);
                    curVolume = defVolume;
                    musicInst->SetVolume(curVolume);
                    fadeVolume = curVolume;
                    add = 0.0f;
                    pitch = 0.0f;
                    pan = 0.0f;
                }

                //--------------------------------------------------------------
                //  ’â~
                //--------------------------------------------------------------
                void stop()
                {
                    if (!musicInst) return;
                    musicInst->Stop();
                }

                //--------------------------------------------------------------
                //  ƒ|[ƒY
                //--------------------------------------------------------------
                void pause()
                {
                    if (!musicInst) return;
                    musicInst->Pause();
                }

                //--------------------------------------------------------------
                //  ƒŒƒWƒ…[ƒ€iƒ|[ƒY‚©‚ç‚Ì•œ‹Aj
                //--------------------------------------------------------------
                void resume()
                {
                    if (!musicInst) return;
                    musicInst->Resume();
                }

                //--------------------------------------------------------------
                //  ƒ{ƒŠƒ…[ƒ€‚Ìİ’è
                //--------------------------------------------------------------
                void setVolume(float volume)
                {
                    if (!musicInst) return;
                    musicInst->SetVolume(volume);
                    curVolume = volume;
                }

                //--------------------------------------------------------------
                //  ƒ{ƒŠƒ…[ƒ€‚Ìæ“¾
                //--------------------------------------------------------------
                float getVolume()
                {
                    return curVolume;
                }

                //--------------------------------------------------------------
                //  ƒtƒF[ƒhƒCƒ“EƒtƒF[ƒhƒAƒEƒg
                //--------------------------------------------------------------
                void fade(float sec, float volume)
                {
                    fadeVolume = volume;
                    add = (fadeVolume - curVolume) / (system::FRAME_RATE * sec);   // 1ƒtƒŒ[ƒ€‚ ‚½‚è‚Ìƒ{ƒŠƒ…[ƒ€‚Ì•ÏˆÊ
                }

                //--------------------------------------------------------------
                //  ó‘Ô‚Ìæ“¾iisInUse‚ªtrue‚Ìê‡‚Ì‚İs‚¤‚±‚Æj
                //--------------------------------------------------------------
                DirectX::SoundState getState()
                {
                    return musicInst->GetState();
                }

                //--------------------------------------------------------------
                //  ƒ‹[ƒv‚Ìæ“¾
                //--------------------------------------------------------------
                bool isLooped()
                {
                    return musicInst->IsLooped();
                }

                //--------------------------------------------------------------
                //  ƒpƒ“‚Ìİ’èi¶‰E‚Ìƒoƒ‰ƒ“ƒXj
                //--------------------------------------------------------------
                void setPan(float p)
                {
                    pan = p;
                    musicInst->SetPan(pan);
                }

                //--------------------------------------------------------------
                //  ƒpƒ“‚Ìæ“¾i¶‰E‚Ìƒoƒ‰ƒ“ƒXj
                //--------------------------------------------------------------
                float getPan()
                {
                    return pan;
                }

                //--------------------------------------------------------------
                //  ƒpƒ“‚Ì’²®
                //--------------------------------------------------------------
                float adjustPan(float p)
                {
                    pan += p;
                    pan = (std::max)((std::min)(pan, 1.0f), -1.0f);
                    musicInst->SetPan(pan);
                    return pan;
                }

                //--------------------------------------------------------------
                //  ƒsƒbƒ`‚Ìİ’è
                //--------------------------------------------------------------
                void setPitch(float p)
                {
                    pitch = p;
                    musicInst->SetPitch(pitch);
                }

                //--------------------------------------------------------------
                //  ƒsƒbƒ`‚Ìæ“¾
                //--------------------------------------------------------------
                float getPitch()
                {
                    return pitch;
                }

                //--------------------------------------------------------------
                //  ƒsƒbƒ`‚Ì’²®
                //--------------------------------------------------------------
                float adjustPitch(float p)
                {
                    pitch += p;
                    pitch = (std::max)((std::min)(pitch, 1.0f), -1.0f);
                    musicInst->SetPitch(pitch);
                    return pitch;
                }

                //--------------------------------------------------------------
                //  ƒtƒH[ƒ}ƒbƒg‚Ìæ“¾
                //--------------------------------------------------------------
                const WAVEFORMATEX* getFormat()
                {
                    return music->GetFormat();
                }

                //--------------------------------------------------------------
                //  ‰¹Šy‚ªg—p‰Â”\‚©‚Ç‚¤‚©
                //--------------------------------------------------------------
                bool isInUse()
                {
                    if (!music) return false;
                    return music->IsInUse();
                }
            };

            class Sound {
            private:
                std::unique_ptr<DirectX::WaveBank>				waveBank                                            = nullptr;
                std::unique_ptr<DirectX::SoundEffectInstance>	soundInst[GameLib::WAVE_FILE_MAX][WAVE_SOUND_MAX]   = {};//Å‘å8‰¹‚ğ“¯Ä¶‰Â”
                float											soundVolume[GameLib::WAVE_FILE_MAX]                 = {};

            public:
                Sound() {}

                //--------------------------------------------------------------
                //  xwbƒtƒ@ƒCƒ‹‚Ì“Ç‚İ‚İ
                //--------------------------------------------------------------
                void load(DirectX::AudioEngine* engine, const wchar_t* xwbFileName, float volume)
                {
                    for (int i = 0; i < WAVE_FILE_MAX; i++)
                    {
                        for (int j = 0; j < WAVE_SOUND_MAX; j++)
                        {
                            if (soundInst[i][j])
                            {
                                soundInst[i][j].reset();
                            }
                        }
                    }

                    waveBank.reset(new DirectX::WaveBank(engine, xwbFileName));
                    for (auto &p : soundVolume) p = volume;
                }

                //--------------------------------------------------------------
                //  Œø‰Ê‰¹‚ÌÄ¶
                //--------------------------------------------------------------
                void play(int trackNo)
                {
                    if (trackNo < 0 || trackNo >= WAVE_FILE_MAX)
                    {
                        assert(!"Œø‰Ê‰¹‚Ìƒgƒ‰ƒbƒN”Ô†ƒGƒ‰[");
                        return;
                    }

                    for (int i = 0; i < WAVE_SOUND_MAX; i++)
                    {
                        if (soundInst[trackNo][i])
                        {
                            DirectX::SoundState state = soundInst[trackNo][i]->GetState();
                            if (state != DirectX::SoundState::STOPPED) continue;
                        }
                        
                        soundInst[trackNo][i] = waveBank->CreateInstance(trackNo);
                        if (soundInst[trackNo][i])
                        {
                            soundInst[trackNo][i]->SetVolume(soundVolume[trackNo]);
                            soundInst[trackNo][i]->Play();
                            break;
                        }
                    }
                }

                //--------------------------------------------------------------
                //  Œø‰Ê‰¹‚Ìƒ{ƒŠƒ…[ƒ€‚ğİ’è
                //--------------------------------------------------------------
                void setVolume(int trackNo, float vol)
                {
                    if (trackNo < 0 || trackNo >= WAVE_FILE_MAX)
                    {
                        assert(!"Œø‰Ê‰¹‚Ìƒgƒ‰ƒbƒN”Ô†ƒGƒ‰[");
                        return;
                    }

                    soundVolume[trackNo] = vol;
                }

                //--------------------------------------------------------------
                //  xwb‚ª—LŒø‚©‚Ç‚¤‚©
                //--------------------------------------------------------------
                bool isInUse()
                {
                    return static_cast<bool>(waveBank);
                }
            };

            //--------------------------------------------------------------
            //  ƒRƒ“ƒXƒgƒ‰ƒNƒ^
            //--------------------------------------------------------------
            DXTKAudio();

            //--------------------------------------------------------------
            //  ƒfƒXƒgƒ‰ƒNƒ^
            //--------------------------------------------------------------
            ~DXTKAudio();

        public:

            //--------------------------------------------------------------
            //  ‰¹Šy‚ÌƒAƒbƒvƒf[ƒg
            //--------------------------------------------------------------
            void update();

            //--------------------------------------------------------------
            //  ƒI[ƒfƒBƒIƒGƒ“ƒWƒ“‚ÌƒŠƒZƒbƒg
            //--------------------------------------------------------------
            bool reset();

            //--------------------------------------------------------------
            //  ‰¹Šy“Ç
            //--------------------------------------------------------------
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //  const wchar_t* waveFileName     ‰¹Šyƒtƒ@ƒCƒ‹‚ÌƒpƒX
            //  float volume                    ƒ{ƒŠƒ…[ƒ€ (0.0f ~ 1.0f)
            //--------------------------------------------------------------
            void musicLoad(int, const wchar_t*, float volume = ( 0.5f ));

            //--------------------------------------------------------------
            //  ‰¹Šy‰ğ•ú
            //--------------------------------------------------------------
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            void musicUnload(int);

            //--------------------------------------------------------------
            //  ‰¹ŠyÄ¶
            //--------------------------------------------------------------
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //  bool isLoop                     ƒ‹[ƒvÄ¶‚·‚é‚©‚Ç‚¤‚©
            //--------------------------------------------------------------
            void musicPlay(int, bool isLoop = ( false ));

            //--------------------------------------------------------------
            //  ‰¹Šy’â~
            //--------------------------------------------------------------
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            void musicStop(int);

            //--------------------------------------------------------------
            //  ‰¹Šyˆê’â~
            //--------------------------------------------------------------
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            void musicPause(int);

            //--------------------------------------------------------------
            //  ‰¹ŠyÄŠJiˆê’â~‚©‚ç‚Ìj
            //--------------------------------------------------------------
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            void musicResume(int);

            //--------------------------------------------------------------
            //  ‰¹Šyƒ{ƒŠƒ…[ƒ€İ’è
            //--------------------------------------------------------------
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //  float volume                    ƒ{ƒŠƒ…[ƒ€ (0.0f ~ 1.0f)
            //--------------------------------------------------------------
            void musicSetVolume(int, float);

            //--------------------------------------------------------------
            //  ‰¹Šyƒ{ƒŠƒ…[ƒ€æ“¾
            //--------------------------------------------------------------
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            float musicGetVolume(int);

            //--------------------------------------------------------------
            //  ‰¹Šy‚ÌƒtƒF[ƒhƒAƒEƒgEƒtƒF[ƒhƒCƒ“
            //--------------------------------------------------------------
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //  float sec                       ƒtƒF[ƒhŠÔ
            //  float volume                    ƒ{ƒŠƒ…[ƒ€ (0.0f ~ 1.0f)
            //--------------------------------------------------------------
            void musicFade(int, float, float);

            //--------------------------------------------------------------
            //  SoundState‚Ìæ“¾
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            DirectX::SoundState musicGetState(int);

            //--------------------------------------------------------------
            //  ƒ‹[ƒv‚Ì—L–³‚Ìæ“¾
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            bool musicIsLooped(int);

            //--------------------------------------------------------------
            //  pan‚Ìİ’è
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //  float pan                       pan (-1.0f ~ 1.0f)
            //--------------------------------------------------------------
            void musicSetPan(int, float);

            //--------------------------------------------------------------
            //  pan‚Ìæ“¾
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            //  –ß‚è’l                           pan‚Ì’l
            //--------------------------------------------------------------
            float musicGetPan(int);

            //--------------------------------------------------------------
            //  pan‚Ì’²®
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //  float add                       pan‚É’Ç‰Á‚·‚é’l
            //--------------------------------------------------------------
            //  –ß‚è’l                           ’²®Œã‚Ìpan‚Ì’l
            //--------------------------------------------------------------
            float musicAdjustPan(int, float);

            //--------------------------------------------------------------
            //  pitch‚Ìİ’è
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //  float pitch                     pitch (-1.0f ~ 1.0f)
            //--------------------------------------------------------------
            void musicSetPitch(int, float);

            //--------------------------------------------------------------
            //  pitch‚Ìæ“¾
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            //  –ß‚è’l                           pitch‚Ì’l
            //--------------------------------------------------------------
            float musicGetPitch(int);

            //--------------------------------------------------------------
            //  pitch‚Ì’²®
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //  float add                       pitch‚É’Ç‰Á‚·‚é’l
            //--------------------------------------------------------------
            //  –ß‚è’l                           ’²®Œã‚Ìpitch‚Ì’l
            //--------------------------------------------------------------
            float musicAdjustPitch(int, float);

            //--------------------------------------------------------------
            //  ƒtƒH[ƒ}ƒbƒg‚Ìæ“¾
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            const WAVEFORMATEX* musicGetFormat(int);

            //--------------------------------------------------------------
            //  ‰¹Šy‚ªg—p‰Â”\‚©‚Ç‚¤‚©
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 31)
            //--------------------------------------------------------------
            bool musicIsInUse(int);

            //--------------------------------------------------------------
            //  Œø‰Ê‰¹‚Ì“Ç
            //--------------------------------------------------------------
            //  int   xwbNo                     ‰½”Ô‚Ìxwb‚©
            //  const wchar_t* xwbFileName      xwbƒtƒ@ƒCƒ‹‚ÌƒpƒX
            //  float volume                    ƒ{ƒŠƒ…[ƒ€ (0.0f ~ 1.0f)
            //--------------------------------------------------------------
            void soundLoad(int xwbNo, const wchar_t*, float volume = ( 0.5f ));

            //--------------------------------------------------------------
            //  Œø‰Ê‰¹‚ÌÄ¶
            //--------------------------------------------------------------
            //  int   xwbNo                     ‰½”Ô‚Ìxwb‚©
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 127)
            //--------------------------------------------------------------
            void soundPlay(int, int);

            //--------------------------------------------------------------
            //  Œø‰Ê‰¹‚Ìƒ{ƒŠƒ…[ƒ€İ’è
            //--------------------------------------------------------------
            //  int   xwbNo                     ‰½”Ô‚Ìxwb‚©
            //  int trackNo                     ƒgƒ‰ƒbƒN”Ô† (0 ~ 127)
            //  float volume                    ƒ{ƒŠƒ…[ƒ€ (0.0f ~ 1.0f)
            //--------------------------------------------------------------
            void soundSetVolume(int, int, float);

            //--------------------------------------------------------------
            //  xwb‚ª—LŒø‚©‚Ç‚¤‚©
            //--------------------------------------------------------------
            //  int   xwbNo                     ‰½”Ô‚Ìxwb‚©
            //--------------------------------------------------------------
            bool xwbIsInUse(int);

            bool isAudioDevicePresent() { return audioEngine->IsAudioDevicePresent(); }
            bool isCriticalError()      { return audioEngine->IsCriticalError(); }

        private:
            //‰¹Šy—p
            std::unique_ptr<DirectX::AudioEngine>			audioEngine                     = nullptr;
            Music                                           music[GameLib::MUSIC_FILE_MAX]  = {};

            //ƒTƒEƒ“ƒh—p
            Sound                                           sound[GameLib::XWB_FILE_MAX]    = {};
        };
    }

}

//******************************************************************************

#endif // !INCLUDED_DXTK_AUDIO
